
&НаКлиенте
Процедура Рассчитать(Команда)
    
    Если Операция = "+" Тогда
        
        Результат = ПервыйОператор + ВторойОператор;
        
    ИначеЕсли Операция = "-" Тогда
        
        Результат = ПервыйОператор - ВторойОператор;
        
    ИначеЕсли Операция = "*" Тогда
        
        Результат = Окр(ПервыйОператор * ВторойОператор,5,РежимОкругления.Окр15как10);
        
    ИначеЕсли Операция = "/" Тогда
        
        Если ВторойОператор = 0 Тогда
            
            Результат = "На 0 делить нельзя!"
            
        Иначе
                    
            Результат = Окр(ПервыйОператор / ВторойОператор,5,РежимОкругления.Окр15как10);
            
        КонецЕсли;
            
    Иначе 
        
        Результат = "Неизвестная операция!";
        
    КонецЕсли;
       
КонецПроцедуры
